tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf6493_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18LF6493_H_
#define _PIC18LF6493_H_

#define LCDPS                         0
#define LP                            1
#define LP0                           2
#define LCDPS0                        3
#define LP1                           4
#define LCDPS1                        5
#define LP2                           6
#define LCDPS2                        7
#define LP3                           8
#define LCDPS3                        9
#define WA                            10
#define LCDA                          11
#define BIASMD                        12
#define WFT                           13
#define LCDCON                        14
#define LMUX0                         15
#define LMUX                          16
#define LMUX1                         17
#define LCDCON_CS                     18
#define CS0                           19
#define LCDCS0                        20
#define CS1                           21
#define LCDCS1                        22
#define WERR                          23
#define LCDWERR                       24
#define LCDSLPEN                      25
#define SLPEN                         26
#define LCDEN                         27
#define SE0                           28
#define SEGEN0                        29
#define LCDSE0                        30
#define SE1                           31
#define SEGEN1                        32
#define SE2                           33
#define SEGEN2                        34
#define SE3                           35
#define SEGEN3                        36
#define SE4                           37
#define SEGEN4                        38
#define SE5                           39
#define SEGEN5                        40
#define SE6                           41
#define SEGEN6                        42
#define SE7                           43
#define SEGEN7                        44
#define SE8                           45
#define SEGEN8                        46
#define LCDSE1                        47
#define SEGEN9                        48
#define SE9                           49
#define SEGEN10                       50
#define SE10                          51
#define SEGEN11                       52
#define SE11                          53
#define SEGEN12                       54
#define SE12                          55
#define SEGEN13                       56
#define SE13                          57
#define SEGEN14                       58
#define SE14                          59
#define SEGEN15                       60
#define SE15                          61
#define SEGEN16                       62
#define LCDSE2                        63
#define SE16                          64
#define SEGEN17                       65
#define SE17                          66
#define SEGEN18                       67
#define SE18                          68
#define SEGEN19                       69
#define SE19                          70
#define SE20                          71
#define SEGEN20                       72
#define SE21                          73
#define SEGEN21                       74
#define SEGEN22                       75
#define SE22                          76
#define SEGEN23                       77
#define SE23                          78
#define SE24                          79
#define SEGEN24                       80
#define LCDSE3                        81
#define SE25                          82
#define SEGEN25                       83
#define SE26                          84
#define SEGEN26                       85
#define SE27                          86
#define SEGEN27                       87
#define SE28                          88
#define SEGEN28                       89
#define SEGEN29                       90
#define SE29                          91
#define SE30                          92
#define SEGEN30                       93
#define SEGEN31                       94
#define SE31                          95
#define SEG0COM0                      96
#define LCDDATA0                      97
#define S00C0                         98
#define S0C0                          99
#define S01C0                         100
#define SEG1COM0                      101
#define S1C0                          102
#define S02C0                         103
#define S2C0                          104
#define SEG2COM0                      105
#define S03C0                         106
#define SEG3COM0                      107
#define S3C0                          108
#define SEG4COM0                      109
#define S4C0                          110
#define S04C0                         111
#define S5C0                          112
#define S05C0                         113
#define SEG5COM0                      114
#define SEG6COM0                      115
#define S6C0                          116
#define S06C0                         117
#define SEG7COM0                      118
#define S7C0                          119
#define S07C0                         120
#define S08C0                         121
#define LCDDATA1                      122
#define S8C0                          123
#define SEG8COM0                      124
#define SEG9COM0                      125
#define S09C0                         126
#define S9C0                          127
#define S10C0                         128
#define SEG10COM0                     129
#define S11C0                         130
#define SEG11COM0                     131
#define S12C0                         132
#define SEG12COM0                     133
#define S13C0                         134
#define SEG13COM0                     135
#define S14C0                         136
#define SEG14COM0                     137
#define SEG15COM0                     138
#define S15C0                         139
#define LCDDATA2                      140
#define S16C0                         141
#define SEG16COM0                     142
#define SEG17COM0                     143
#define S17C0                         144
#define SEG18COM0                     145
#define S18C0                         146
#define S19C0                         147
#define SEG19COM0                     148
#define S20C0                         149
#define SEG20COM0                     150
#define S21C0                         151
#define SEG21COM0                     152
#define SEG22COM0                     153
#define S22C0                         154
#define S23C0                         155
#define SEG23COM0                     156
#define LCDDATA3                      157
#define S24C0                         158
#define SEG24COM0                     159
#define S25C0                         160
#define SEG25COM0                     161
#define S26C0                         162
#define SEG26COM0                     163
#define SEG27COM0                     164
#define S27C0                         165
#define SEG28COM0                     166
#define S28C0                         167
#define SEG29COM0                     168
#define S29C0                         169
#define S30C0                         170
#define SEG30COM0                     171
#define SEG31COM0                     172
#define S31C0                         173
#define S32C0                         174
#define LCDDATA4                      175
#define SEG32COM0                     176
#define SEG33COM0                     177
#define S33C0                         178
#define S34C0                         179
#define SEG34COM0                     180
#define S35C0                         181
#define SEG35COM0                     182
#define S36C0                         183
#define SEG36COM0                     184
#define SEG37COM0                     185
#define S37C0                         186
#define S38C0                         187
#define SEG38COM0                     188
#define SEG39COM0                     189
#define S39C0                         190
#define LCDDATA5                      191
#define S40C0                         192
#define SEG40COM0                     193
#define S40C15                        194
#define SEG41COM0                     195
#define S41C0                         196
#define S42C0                         197
#define SEG42COM0                     198
#define S43C0                         199
#define SEG43COM0                     200
#define SEG44COM0                     201
#define S44C0                         202
#define S45C0                         203
#define SEG45COM0                     204
#define S46C0                         205
#define SEG46COM0                     206
#define S47C0                         207
#define SEG47COM0                     208
#define SEG0COM1                      209
#define LCDDATA6                      210
#define S00C1                         211
#define S0C1                          212
#define S01C1                         213
#define SEG1COM1                      214
#define S1C1                          215
#define S02C1                         216
#define S2C1                          217
#define SEG2COM1                      218
#define S03C1                         219
#define SEG3COM1                      220
#define S3C1                          221
#define SEG4COM1                      222
#define S4C1                          223
#define S04C1                         224
#define S5C1                          225
#define S05C1                         226
#define SEG5COM1                      227
#define SEG6COM1                      228
#define S6C1                          229
#define S06C1                         230
#define SEG7COM1                      231
#define S7C1                          232
#define S07C1                         233
#define LCDDATA7                      234
#define S08C1                         235
#define S8C1                          236
#define SEG8COM1                      237
#define SEG9COM1                      238
#define S09C1                         239
#define S9C1                          240
#define S10C1                         241
#define SEG10COM1                     242
#define S11C1                         243
#define SEG11COM1                     244
#define S12C1                         245
#define SEG12COM1                     246
#define S13C1                         247
#define SEG13COM1                     248
#define S14C1                         249
#define SEG14COM1                     250
#define SEG15COM1                     251
#define S15C1                         252
#define SEG16COM1                     253
#define LCDDATA8                      254
#define S16C1                         255
#define SEG17COM1                     256
#define S17C1                         257
#define SEG18COM1                     258
#define S18C1                         259
#define S19C1                         260
#define SEG19COM1                     261
#define S20C1                         262
#define SEG20COM1                     263
#define S21C1                         264
#define SEG21COM1                     265
#define SEG22COM1                     266
#define S22C1                         267
#define S23C1                         268
#define SEG23COM1                     269
#define S24C1                         270
#define SEG24COM1                     271
#define LCDDATA9                      272
#define S25C1                         273
#define SEG25COM1                     274
#define S26C1                         275
#define SEG26COM1                     276
#define SEG27COM1                     277
#define S27C1                         278
#define SEG28COM1                     279
#define S28C1                         280
#define SEG29COM1                     281
#define S29C1                         282
#define SEG30COM1                     283
#define S30C1                         284
#define S31C1                         285
#define SEG31COM1                     286
#define S32C1                         287
#define LCDDATA10                     288
#define SEG32COM1                     289
#define SEG33COM1                     290
#define S33C1                         291
#define S34C1                         292
#define SEG34COM1                     293
#define S35C1                         294
#define SEG35COM1                     295
#define S36C1                         296
#define SEG36COM1                     297
#define SEG37COM1                     298
#define S37C1                         299
#define S38C1                         300
#define SEG38COM1                     301
#define SEG39COM1                     302
#define S39C1                         303
#define RCSTA2                        304
#define RCD82                         305
#define RX9D2                         306
#define RCSTA2_RCD8                   307
#define RCSTA2_RX9D                   308
#define RCSTA2_OERR                   309
#define OERR2                         310
#define FERR2                         311
#define RCSTA2_FERR                   312
#define RCSTA2_ADEN                   313
#define ADDEN2                        314
#define RCSTA2_ADDEN                  315
#define RCSTA2_CREN                   316
#define CREN2                         317
#define SREN2                         318
#define RCSTA2_SREN                   319
#define RC92                          320
#define RCSTA2_RX9                    321
#define RCSTA2_RC9                    322
#define RC8_92                        323
#define RCSTA2_RC8_9                  324
#define nRC8                          325
#define NOT_RC8                       326
#define RX92                          327
#define RCSTA2_SPEN                   328
#define SPEN2                         329
#define TXSTA2                        330
#define TXSTA2_TXD8                   331
#define TX9D2                         332
#define TXSTA2_TX9D                   333
#define TXD82                         334
#define TRMT2                         335
#define TXSTA2_TRMT                   336
#define BRGH2                         337
#define TXSTA2_BRGH                   338
#define SENDB2                        339
#define TXSTA2_SYNC                   340
#define SYNC2                         341
#define TXEN2                         342
#define TXSTA2_TXEN                   343
#define TX8_92                        344
#define TX92                          345
#define TXSTA2_TX9                    346
#define NOT_TX8                       347
#define nTX8                          348
#define TXSTA2_TX8_9                  349
#define TXSTA2_CSRC                   350
#define CSRC2                         351
#define SEG40COM1                     352
#define S40C1                         353
#define LCDDATA11                     354
#define SEG41COM1                     355
#define S41C1                         356
#define ADMSK1                        357
#define SEG42COM1                     358
#define S42C1                         359
#define ADMSK2                        360
#define SEG43COM1                     361
#define S43C1                         362
#define ADMSK3                        363
#define SEG44COM1                     364
#define S44C1                         365
#define ADMSK4                        366
#define SEG45COM1                     367
#define S45C1                         368
#define ADMSK5                        369
#define S46C1                         370
#define SEG46COM1                     371
#define S47C1                         372
#define SEG47COM1                     373
#define SEG0COM2                      374
#define SSPM012                       375
#define LCDDATA12                     376
#define S00C2                         377
#define S0C2                          378
#define S01C2                         379
#define SSPM112                       380
#define SEG1COM2                      381
#define S1C2                          382
#define S02C2                         383
#define S2C2                          384
#define SEG2COM2                      385
#define SSPM212                       386
#define S03C2                         387
#define SEG3COM2                      388
#define S3C2                          389
#define SSPM312                       390
#define SEG4COM2                      391
#define S4C2                          392
#define S04C2                         393
#define S5C2                          394
#define S05C2                         395
#define SEG5COM2                      396
#define SEG6COM2                      397
#define S6C2                          398
#define S06C2                         399
#define SEG7COM2                      400
#define S7C2                          401
#define S07C2                         402
#define LCDDATA13                     403
#define S08C2                         404
#define S8C2                          405
#define SEG8COM2                      406
#define SEG9COM2                      407
#define S09C2                         408
#define S9C2                          409
#define S10C2                         410
#define SEG10COM2                     411
#define SEG11COM2                     412
#define S11C2                         413
#define S12C2                         414
#define SEG12COM2                     415
#define S13C2                         416
#define SEG13COM2                     417
#define S14C2                         418
#define SEG14COM2                     419
#define S15C2                         420
#define SEG15COM2                     421
#define SEG16COM2                     422
#define S16C2                         423
#define MSK0                          424
#define LCDDATA14                     425
#define S17C2                         426
#define MSK1                          427
#define SEG17COM2                     428
#define S18C2                         429
#define SEG18COM2                     430
#define MSK2                          431
#define S19C2                         432
#define SEG19COM2                     433
#define MSK3                          434
#define MSK4                          435
#define S20C2                         436
#define SEG20COM2                     437
#define MSK5                          438
#define S21C2                         439
#define SEG21COM2                     440
#define SEG22COM2                     441
#define MSK6                          442
#define S22C2                         443
#define SEG23COM2                     444
#define MSK7                          445
#define S23C2                         446
#define LCDDATA15                     447
#define S24C2                         448
#define SEG24COM2                     449
#define S25C2                         450
#define SEG25COM2                     451
#define S26C2                         452
#define SEG26COM2                     453
#define SEG27COM2                     454
#define S27C2                         455
#define S28C2                         456
#define SEG28COM2                     457
#define SEG29COM2                     458
#define S29C2                         459
#define SEG30COM2                     460
#define S30C2                         461
#define SEG31COM2                     462
#define S31C2                         463
#define S32C2                         464
#define LCDDATA16                     465
#define SEG32COM2                     466
#define T4CKPS016                     467
#define T4CKPS116                     468
#define SEG33COM2                     469
#define S33C2                         470
#define S34C2                         471
#define SEG34COM2                     472
#define T4OUTPS016                    473
#define S35C2                         474
#define SEG35COM2                     475
#define T4OUTPS116                    476
#define SEG36COM2                     477
#define S36C2                         478
#define T4OUTPS216                    479
#define S37C2                         480
#define SEG37COM2                     481
#define SEG38COM2                     482
#define S38C2                         483
#define T4OUTPS316                    484
#define SEG39COM2                     485
#define S39C2                         486
#define LCDDATA17                     487
#define S40C2                         488
#define SEG40COM2                     489
#define SEG41COM2                     490
#define S41C2                         491
#define S42C2                         492
#define SEG42COM2                     493
#define S43C2                         494
#define SEG43COM2                     495
#define SEG44COM2                     496
#define S44C2                         497
#define S45C2                         498
#define SEG45COM2                     499
#define S46C2                         500
#define SEG46COM2                     501
#define S47C2                         502
#define SEG47COM2                     503
#define SEG0COM3                      504
#define LCDDATA18                     505
#define S00C3                         506
#define S0C3                          507
#define S01C3                         508
#define SEG1COM3                      509
#define S1C3                          510
#define S02C3                         511
#define S2C3                          512
#define SEG2COM3                      513
#define S03C3                         514
#define SEG3COM3                      515
#define S3C3                          516
#define SEG4COM3                      517
#define S4C3                          518
#define S04C3                         519
#define S5C3                          520
#define S05C3                         521
